title: Suspicious Encoded PowerShell
id: 8d2b1234
status: experimental
description: Detect encoded PowerShell
author: SentinelForge
falsepositives:
  - Admin scripts
logsource:
  category: process_creation
  product: windows

detection:
  selection:
    process_name: powershell.exe
    command_line|contains: "-enc"
  condition: selection

level: high

tags:
  - attack.execution
  - attack.t1059.001
